// 1 What is a function? 
// ფუნცია არის პარამეტრი რომელსაც გადავცემთ არგუმენტებს, რომლის გამოძახებაც ნებისმიერ დროს შეგვიძლია. ის ასევე ინახავს მასში მოცემულ ინფორმაციას ცვლადებშ მაგრამ როგორც კი ჯიესი გაივლის მასში ეს ცვლადი ქრება. 
// 2 What is a function call?
// ფუნქციის გამოძახებას ეწოდება ქოლი ან invoke 
// 3 What is a code block, and how does it relate to a function? 
// ბლოკი არის ის რაც ფუნქციის შიგნით იწერება {
//     აქ რაც იწერება და ფუნქციის გამოძახების დროს ბლოკში მოცემულ ინფორმაცია გამოქვს კონსოლში
// }
// 4
// function greetUser(user) {
//     console.log(`hello ${user}`);
// }
// greetUser("john");
// 5